* TaskJuggler integration with org-mode
** Install
You only will be able to use [[https://gist.github.com/anoduck/4adf306252f6b8c8759a][ox-taskjuggler]] by downloading from github and "underground" repositories. It's not even in the [[https://orgmode.org/worg/org-contrib/][org-plus-contrib]].

** After download
Let's say you put your hand-made packages.el under =~/.emacs.d/lisp/=. And, you have added it to your path. e.g.,

#+begin_src emacs-lisp
(add-to-list 'load-path (concat user-emacs-directory "lisp/"))
#+end_src

#+RESULTS:
| ~/.emacs.d/lisp/ | /home/buddhilw/.emacs.d/elpa/org-plus-contrib-20210531 | /home/buddhilw/.emacs.d/elpa/slime-20210512.1220/contrib | ~/.emacs.d/tern/ | /home/buddhilw/.emacs.d/elpa/org-ref-20210510.1614/citeproc/csl | /home/buddhilw/.emacs.d/elpa/org-ref-20210510.1614/citeproc | /home/buddhilw/.emacs.d/elpa/ac-cider-20161006.719 | /home/buddhilw/.emacs.d/elpa/ac-ispell-20151101.226 | /home/buddhilw/.emacs.d/elpa/ac-js2-20190101.933 | /home/buddhilw/.emacs.d/elpa/ac-slime-20171027.2100 | /home/buddhilw/.emacs.d/elpa/ace-link-20210121.923 | /home/buddhilw/.emacs.d/elpa/ag-20201031.2202 | /home/buddhilw/.emacs.d/elpa/all-the-icons-dired-20210422.921 | /home/buddhilw/.emacs.d/elpa/amd-mode-20180111.1402 | /home/buddhilw/.emacs.d/elpa/auctex-13.0.11/ | /home/buddhilw/.emacs.d/elpa/auctex-13.0.11 | /home/buddhilw/.emacs.d/elpa/auto-complete-20201213.1255 | /home/buddhilw/.emacs.d/elpa/auto-package-update-20210211.2036 | /home/buddhilw/.emacs.d/elpa/bibtex-utils-20190703.2117 | /home/buddhilw/.emacs.d/elpa/cdnjs-20161031.1522 | /home/buddhilw/.emacs.d/elpa/clojure-snippets-20180314.1308 | /home/buddhilw/.emacs.d/elpa/command-log-mode-20160413.447 | /home/buddhilw/.emacs.d/elpa/company-bibtex-20171105.644 | /home/buddhilw/.emacs.d/elpa/company-box-20210330.1155 | /home/buddhilw/.emacs.d/elpa/company-ctags-20210528.1311 | /home/buddhilw/.emacs.d/elpa/company-quickhelp-20210515.2212 | /home/buddhilw/.emacs.d/elpa/company-tabnine-20210310.2247 | /home/buddhilw/.emacs.d/elpa/context-coloring-8.1.0 | /home/buddhilw/.emacs.d/elpa/counsel-css-20210310.452 | /home/buddhilw/.emacs.d/elpa/counsel-dash-20200103.1411 | /home/buddhilw/.emacs.d/elpa/counsel-projectile-20201015.1109 | /home/buddhilw/.emacs.d/elpa/counsel-20210509.830 | /home/buddhilw/.emacs.d/elpa/dap-mode-20210519.1554 | /home/buddhilw/.emacs.d/elpa/bui-20210108.1141 | /home/buddhilw/.emacs.d/elpa/dash-docs-20200516.1943 | /home/buddhilw/.emacs.d/elpa/dash-functional-20210210.1449 | /home/buddhilw/.emacs.d/elpa/desktop-environment-20210129.2018 | /home/buddhilw/.emacs.d/elpa/diffpdf-20210307.932 | /home/buddhilw/.emacs.d/elpa/dired-hide-dotfiles-20210222.1919 | /home/buddhilw/.emacs.d/elpa/dired-open-20180922.1113 | /home/buddhilw/.emacs.d/elpa/dired-hacks-utils-20201005.2318 | /home/buddhilw/.emacs.d/elpa/dired-single-20200824.708 | /home/buddhilw/.emacs.d/elpa/doom-modeline-20210527.840 | /home/buddhilw/.emacs.d/elpa/all-the-icons-20210526.2356 | /home/buddhilw/.emacs.d/elpa/edit-indirect-20200805.1840 | /home/buddhilw/.emacs.d/elpa/elm-mode-20210525.152 | /home/buddhilw/.emacs.d/elpa/elm-yasnippets-20160401.524 | /home/buddhilw/.emacs.d/elpa/emmet-mode-20180613.341 | /home/buddhilw/.emacs.d/elpa/emojify-20210108.1111 | /home/buddhilw/.emacs.d/elpa/eshell-git-prompt-20200109.2250 | /home/buddhilw/.emacs.d/elpa/eslint-fix-20180514.700 | /home/buddhilw/.emacs.d/elpa/eslintd-fix-20210513.425 | /home/buddhilw/.emacs.d/elpa/eterm-256color-20210224.2241 | /home/buddhilw/.emacs.d/elpa/evil-collection-20210527.1624 | /home/buddhilw/.emacs.d/elpa/annalist-20190929.207 | /home/buddhilw/.emacs.d/elpa/evil-multiedit-20200229.528 | /home/buddhilw/.emacs.d/elpa/evil-nerd-commenter-20210528.1009 | /home/buddhilw/.emacs.d/elpa/evil-smartparens-20171210.1513 | /home/buddhilw/.emacs.d/elpa/evil-surround-20200603.2216 | /home/buddhilw/.emacs.d/elpa/evil-20210527.2107 | /home/buddhilw/.emacs.d/elpa/ewal-doom-themes-20200922.325 | /home/buddhilw/.emacs.d/elpa/doom-themes-20210531.2212 | /home/buddhilw/.emacs.d/elpa/ewal-evil-cursors-20190911.1315 | /home/buddhilw/.emacs.d/elpa/ewal-spacemacs-themes-20190911.1305 | /home/buddhilw/.emacs.d/elpa/ewal-20200305.230 | /home/buddhilw/.emacs.d/elpa/exec-path-from-shell-20201215.33 | /home/buddhilw/.emacs.d/elpa/exwm-0.24 | /home/buddhilw/.emacs.d/elpa/fira-code-mode-20201005.1607 | /home/buddhilw/.emacs.d/elpa/flycheck-aspell-20210411.2342 | /home/buddhilw/.emacs.d/elpa/flycheck-clojure-20191215.2227 | /home/buddhilw/.emacs.d/elpa/flycheck-elm-20181107.146 | /home/buddhilw/.emacs.d/elpa/flymake-css-20170723.146 | /home/buddhilw/.emacs.d/elpa/flymake-easy-20140818.755 | /home/buddhilw/.emacs.d/elpa/flymake-eslint-20191129.1558 | /home/buddhilw/.emacs.d/elpa/flymake-gjshint-20130327.1232 | /home/buddhilw/.emacs.d/elpa/forge-20210525.1345 | /home/buddhilw/.emacs.d/elpa/closql-20210530.1136 | /home/buddhilw/.emacs.d/elpa/emacsql-sqlite-20190727.1710 | /home/buddhilw/.emacs.d/elpa/frame-local-20180330.940 | /home/buddhilw/.emacs.d/elpa/general-20200516.50 | /home/buddhilw/.emacs.d/elpa/ghub-20210526.1055 | /home/buddhilw/.emacs.d/elpa/goto-chg-20210508.1632 | /home/buddhilw/.emacs.d/elpa/gscholar-bibtex-20190130.555 | /home/buddhilw/.emacs.d/elpa/helm-clojuredocs-20160405.723 | /home/buddhilw/.emacs.d/elpa/helpful-20210319.802 | /home/buddhilw/.emacs.d/elpa/elisp-refs-20200815.2357 | /home/buddhilw/.emacs.d/elpa/iedit-20210402.854 | /home/buddhilw/.emacs.d/elpa/indent-guide-20210115.400 | /home/buddhilw/.emacs.d/elpa/indium-20210309.1210 | /home/buddhilw/.emacs.d/elpa/inf-clojure-20210322.1421 | /home/buddhilw/.emacs.d/elpa/ivy-clojuredocs-20201129.2355 | /home/buddhilw/.emacs.d/elpa/edn-20160215.1219 | /home/buddhilw/.emacs.d/elpa/ivy-prescient-20210425.1720 | /home/buddhilw/.emacs.d/elpa/ivy-rich-20210409.931 | /home/buddhilw/.emacs.d/elpa/js-doc-20160715.434 | /home/buddhilw/.emacs.d/elpa/js-react-redux-yasnippets-20200316.1144 | /home/buddhilw/.emacs.d/elpa/js2-highlight-vars-20170418.1829 | /home/buddhilw/.emacs.d/elpa/js3-mode-20160515.1550 | /home/buddhilw/.emacs.d/elpa/jsfmt-20180920.1008 | /home/buddhilw/.emacs.d/elpa/json-process-client-20210525.733 | /home/buddhilw/.emacs.d/elpa/jss-20130508.1423 | /home/buddhilw/.emacs.d/elpa/jst-20150604.1138 | /home/buddhilw/.emacs.d/elpa/lockfile-mode-20170625.507 | /home/buddhilw/.emacs.d/elpa/lsp-ivy-20210518.2034 | /home/buddhilw/.emacs.d/elpa/lsp-treemacs-20210502.1804 | /home/buddhilw/.emacs.d/elpa/lsp-ui-20210521.1912 | /home/buddhilw/.emacs.d/elpa/lsp-mode-20210530.1518 | /home/buddhilw/.emacs.d/elpa/magit-20210531.1524 | /home/buddhilw/.emacs.d/elpa/git-commit-20210525.844 | /home/buddhilw/.emacs.d/elpa/magit-section-20210525.844 | /home/buddhilw/.emacs.d/elpa/markdown-mode-20210530.1825 | /home/buddhilw/.emacs.d/elpa/mutt-mode-20191102.2330 | /home/buddhilw/.emacs.d/elpa/neotree-20200324.1946 | /home/buddhilw/.emacs.d/elpa/no-littering-20210124.1559 | /home/buddhilw/.emacs.d/elpa/npm-20210601.1122 | /home/buddhilw/.emacs.d/elpa/jest-20210219.1508 | /home/buddhilw/.emacs.d/elpa/magit-popup-20200719.1015 | /home/buddhilw/.emacs.d/elpa/npm-mode-20190616.2025 | /home/buddhilw/.emacs.d/elpa/nyan-mode-20200526.1054 | /home/buddhilw/.emacs.d/elpa/ob-browser-20170720.1918 | /home/buddhilw/.emacs.d/elpa/ob-clojurescript-20180406.1828 | /home/buddhilw/.emacs.d/elpa/ob-html-chrome-20181219.1042 | /home/buddhilw/.emacs.d/elpa/ob-latex-as-png-20200629.1013 | /home/buddhilw/.emacs.d/elpa/org-brain-20210515.1814 | /home/buddhilw/.emacs.d/elpa/org-bullets-20200317.1740 | /home/buddhilw/.emacs.d/elpa/org-download-20210118.958 | /home/buddhilw/.emacs.d/elpa/org-easy-img-insert-20160915.2008 | /home/buddhilw/.emacs.d/elpa/org-inline-pdf-20210119.529 | /home/buddhilw/.emacs.d/elpa/org-noter-pdftools-20210118.1611 | /home/buddhilw/.emacs.d/elpa/org-pdftools-20210118.1611 | /home/buddhilw/.emacs.d/elpa/org-noter-20191020.1212 | /home/buddhilw/.emacs.d/elpa/org-roam-bibtex-20210507.2051 | /home/buddhilw/.emacs.d/elpa/org-ref-20210510.1614 | /home/buddhilw/.emacs.d/elpa/key-chord-20201222.2030 | /home/buddhilw/.emacs.d/elpa/helm-bibtex-20201214.2111 | /home/buddhilw/.emacs.d/elpa/helm-20210531.709 | /home/buddhilw/.emacs.d/elpa/helm-core-20210525.2002 | /home/buddhilw/.emacs.d/elpa/async-20210501.1527 | /home/buddhilw/.emacs.d/elpa/htmlize-20200816.746 | /home/buddhilw/.emacs.d/elpa/bibtex-completion-20210408.1649 | /home/buddhilw/.emacs.d/elpa/biblio-20210418.406 | /home/buddhilw/.emacs.d/elpa/biblio-core-20210418.406 | /home/buddhilw/.emacs.d/elpa/org-roam-20210513.804 | /home/buddhilw/.emacs.d/elpa/emacsql-sqlite3-20200914.508 | /home/buddhilw/.emacs.d/elpa/emacsql-20200714.28 | /home/buddhilw/.emacs.d/elpa/org-trello-20210314.1901 | /home/buddhilw/.emacs.d/elpa/ox-hugo-20210518.108 | /home/buddhilw/.emacs.d/elpa/paredit-20191121.2328 | /home/buddhilw/.emacs.d/elpa/parsebib-20210108.1525 | /home/buddhilw/.emacs.d/elpa/pdf-view-restore-20190904.1708 | /home/buddhilw/.emacs.d/elpa/pdf-tools-20210531.1613 | /home/buddhilw/.emacs.d/elpa/peg-1.0 | /home/buddhilw/.emacs.d/elpa/pnpm-mode-20200527.557 | /home/buddhilw/.emacs.d/elpa/popup-20210317.138 | /home/buddhilw/.emacs.d/elpa/prescient-20210425.1720 | /home/buddhilw/.emacs.d/elpa/prettier-js-20180109.726 | /home/buddhilw/.emacs.d/elpa/projectile-20210531.547 | /home/buddhilw/.emacs.d/elpa/python-mode-20210526.931 | /home/buddhilw/.emacs.d/elpa/pyvenv-20210527.829 | /home/buddhilw/.emacs.d/elpa/racket-mode-20210528.1504 | /home/buddhilw/.emacs.d/elpa/pos-tip-20191227.1356 | /home/buddhilw/.emacs.d/elpa/rainbow-delimiters-20210515.1254 | /home/buddhilw/.emacs.d/elpa/rainbow-mode-1.0.5 | /home/buddhilw/.emacs.d/elpa/reformatter-20210510.522 | /home/buddhilw/.emacs.d/elpa/request-deferred-20210214.37 | /home/buddhilw/.emacs.d/elpa/deferred-20170901.1330 | /home/buddhilw/.emacs.d/elpa/rjsx-mode-20200120.1446 | /home/buddhilw/.emacs.d/elpa/saveplace-pdf-view-20210217.1312 | /home/buddhilw/.emacs.d/elpa/scribble-mode-20190912.200 | /home/buddhilw/.emacs.d/elpa/scss-mode-20180123.1708 | /home/buddhilw/.emacs.d/elpa/shrink-path-20190208.1335 | /home/buddhilw/.emacs.d/elpa/f-20191110.1357 | /home/buddhilw/.emacs.d/elpa/skewer-mode-20200304.1142 | /home/buddhilw/.emacs.d/elpa/simple-httpd-20191103.1446 | /home/buddhilw/.emacs.d/elpa/slime-company-20210124.1627 | /home/buddhilw/.emacs.d/elpa/company-20210527.1610 | /home/buddhilw/.emacs.d/elpa/slime-20210512.1220 | /home/buddhilw/.emacs.d/elpa/macrostep-20161120.2106 | /home/buddhilw/.emacs.d/elpa/smartparens-20210529.1129 | /home/buddhilw/.emacs.d/elpa/sotclojure-20170922.8 | /home/buddhilw/.emacs.d/elpa/cider-20210524.832 | /home/buddhilw/.emacs.d/elpa/sesman-20190909.1754 | /home/buddhilw/.emacs.d/elpa/queue-0.2 | /home/buddhilw/.emacs.d/elpa/parseedn-20200419.1124 | /home/buddhilw/.emacs.d/elpa/parseclj-20201012.712 | /home/buddhilw/.emacs.d/elpa/a-20201203.1927 | /home/buddhilw/.emacs.d/elpa/clojure-mode-20210505.712 | /home/buddhilw/.emacs.d/elpa/sotlisp-20190211.2026 | /home/buddhilw/.emacs.d/elpa/spaceline-20201016.1043 | /home/buddhilw/.emacs.d/elpa/powerline-20210527.1953 | /home/buddhilw/.emacs.d/elpa/spacemacs-theme-20210206.1428 | /home/buddhilw/.emacs.d/elpa/spinner-1.7.3 | /home/buddhilw/.emacs.d/elpa/sudo-edit-20210108.420 | /home/buddhilw/.emacs.d/elpa/swiper-20210521.1319 | /home/buddhilw/.emacs.d/elpa/tablist-20200427.2205 | /home/buddhilw/.emacs.d/elpa/tern-20181108.722 | /home/buddhilw/.emacs.d/elpa/tide-20210517.507 | /home/buddhilw/.emacs.d/elpa/flycheck-20210321.852 | /home/buddhilw/.emacs.d/elpa/seq-2.22 | /home/buddhilw/.emacs.d/elpa/pkg-info-20150517.1143 | /home/buddhilw/.emacs.d/elpa/epl-20180205.2049 | /home/buddhilw/.emacs.d/elpa/tj3-mode-20180519.1228 | /home/buddhilw/.emacs.d/elpa/transient-20210601.842 | /home/buddhilw/.emacs.d/elpa/treemacs-20210524.1338 | /home/buddhilw/.emacs.d/elpa/cfrs-20210529.1123 | /home/buddhilw/.emacs.d/elpa/ht-20210119.741 | /home/buddhilw/.emacs.d/elpa/hydra-20201115.1055 | /home/buddhilw/.emacs.d/elpa/lv-20200507.1518 | /home/buddhilw/.emacs.d/elpa/pfuture-20200425.1357 | /home/buddhilw/.emacs.d/elpa/ace-window-20200606.1259 | /home/buddhilw/.emacs.d/elpa/avy-20201226.1734 | /home/buddhilw/.emacs.d/elpa/treepy-20191108.2217 | /home/buddhilw/.emacs.d/elpa/typescript-mode-20201002.1109 | /home/buddhilw/.emacs.d/elpa/undo-tree-0.7.5 | /home/buddhilw/.emacs.d/elpa/unicode-escape-20160614.1234 | /home/buddhilw/.emacs.d/elpa/names-20180321.1155 | /home/buddhilw/.emacs.d/elpa/unicode-fonts-20200803.1335 | /home/buddhilw/.emacs.d/elpa/ucs-utils-20150826.1414 | /home/buddhilw/.emacs.d/elpa/font-utils-20210405.1149 | /home/buddhilw/.emacs.d/elpa/persistent-soft-20150223.1853 | /home/buddhilw/.emacs.d/elpa/list-utils-20210111.1522 | /home/buddhilw/.emacs.d/elpa/pcache-20201226.634 | /home/buddhilw/.emacs.d/elpa/use-package-20210207.1926 | /home/buddhilw/.emacs.d/elpa/visual-fill-column-20210419.857 | /home/buddhilw/.emacs.d/elpa/vterm-20210409.1558 | /home/buddhilw/.emacs.d/elpa/vuiet-20210323.911 | /home/buddhilw/.emacs.d/elpa/mpv-20210207.1140 | /home/buddhilw/.emacs.d/elpa/org-20210531 | /home/buddhilw/.emacs.d/elpa/bind-key-20210210.1609 | /home/buddhilw/.emacs.d/elpa/versuri-20200316.852 | /home/buddhilw/.emacs.d/elpa/ivy-20210518.1815 | /home/buddhilw/.emacs.d/elpa/esqlite-20151206.1206 | /home/buddhilw/.emacs.d/elpa/pcsv-20150220.1131 | /home/buddhilw/.emacs.d/elpa/esxml-20210323.1102 | /home/buddhilw/.emacs.d/elpa/kv-20140108.1534 | /home/buddhilw/.emacs.d/elpa/lastfm-20201212.836 | /home/buddhilw/.emacs.d/elpa/elquery-20200628.1756 | /home/buddhilw/.emacs.d/elpa/memoize-20200103.2036 | /home/buddhilw/.emacs.d/elpa/anaphora-20180618.2200 | /home/buddhilw/.emacs.d/elpa/request-20210410.2218 | /home/buddhilw/.emacs.d/elpa/web-beautify-20161115.2247 | /home/buddhilw/.emacs.d/elpa/web-mode-20210131.1758 | /home/buddhilw/.emacs.d/elpa/webkit-color-picker-20180325.736 | /home/buddhilw/.emacs.d/elpa/posframe-20210601.244 | /home/buddhilw/.emacs.d/elpa/websocket-20210110.17 | /home/buddhilw/.emacs.d/elpa/which-key-20210601.252 | /home/buddhilw/.emacs.d/elpa/widgetjs-20160719.1504 | /home/buddhilw/.emacs.d/elpa/js2-refactor-20210306.2003 | /home/buddhilw/.emacs.d/elpa/dash-20210330.1544 | /home/buddhilw/.emacs.d/elpa/multiple-cursors-20210323.1128 | /home/buddhilw/.emacs.d/elpa/s-20180406.808 | /home/buddhilw/.emacs.d/elpa/makey-20131231.1430 | /home/buddhilw/.emacs.d/elpa/with-editor-20210524.1654 | /home/buddhilw/.emacs.d/elpa/xelb-0.18 | /home/buddhilw/.emacs.d/elpa/xref-js2-20210310.1238 | /home/buddhilw/.emacs.d/elpa/js2-mode-20210414.2241 | /home/buddhilw/.emacs.d/elpa/xterm-color-20200605.2017 | /home/buddhilw/.emacs.d/elpa/xwidgete-20171118.2116 | /home/buddhilw/.emacs.d/elpa/yasnippet-snippets-20210408.1234 | /home/buddhilw/.emacs.d/elpa/yasnippet-20200604.246 | /home/buddhilw/.emacs.d/elpa/zenity-color-picker-20160302.1154 | /usr/share/emacs/27.2/site-lisp | /usr/share/emacs/site-lisp | /usr/share/emacs/27.2/lisp | /usr/share/emacs/27.2/lisp/vc | /usr/share/emacs/27.2/lisp/url | /usr/share/emacs/27.2/lisp/textmodes | /usr/share/emacs/27.2/lisp/progmodes | /usr/share/emacs/27.2/lisp/play | /usr/share/emacs/27.2/lisp/org | /usr/share/emacs/27.2/lisp/nxml | /usr/share/emacs/27.2/lisp/net | /usr/share/emacs/27.2/lisp/mh-e | /usr/share/emacs/27.2/lisp/mail | /usr/share/emacs/27.2/lisp/leim | /usr/share/emacs/27.2/lisp/language | /usr/share/emacs/27.2/lisp/international | /usr/share/emacs/27.2/lisp/image | /usr/share/emacs/27.2/lisp/gnus | /usr/share/emacs/27.2/lisp/eshell | /usr/share/emacs/27.2/lisp/erc | /usr/share/emacs/27.2/lisp/emulation | /usr/share/emacs/27.2/lisp/emacs-lisp | /usr/share/emacs/27.2/lisp/cedet | /usr/share/emacs/27.2/lisp/calendar | /usr/share/emacs/27.2/lisp/calc | /usr/share/emacs/27.2/lisp/obsolete |

** Require the package
Now, you have to require the package to be loaded, so you can use it, in org-mode
#+begin_src emacs-lisp
(require 'ox-taskjuggler)
#+end_src

** Configure the package as a backend for org-mode
#+begin_src emacs-lisp
  (add-to-list 'org-export-backends 'taskjuggler)
#+end_src

#+RESULTS:
| taskjuggler | ascii | html | icalendar | latex | odt |

** Use

After you done your [[https://orgmode.org/worg/org-tutorials/org-taskjuggler.html#fn.1][annotations]], you can export to taskjuggler by
#+begin_example
M-x org-taskjuggler-export
M-x org-taskjuggler-export-and-open
#+end_example


* Convert TaskJuggler html to pdf, using =pandoc=

About the software, pandoc is a Haskell-written program. It serves many backends to convert in-between file extensions.

** Requirements
You will need a backend to transform html into pdf.

There are three main: wkhtmltopdf, weasyprint and prince

- wkhtmltopdf
  + lincensed under GPL3 (GNU Private License)
  + C++
- weasyprint
  + open sourced under BSD License
  + Python
    
Simply, use this one-liner:
#+begin_src shell
pandoc html-file.html -o pdf-file.pdf
#+end_src
